{
  "products": [
    {
      "category": "Productivity Tools",
      "category_url": "productivity-tools",
      "name": "Agile Planner Notebook",
      "price": "$10.00",
      "url_name": "agile-planner-notebook",
      "full_url": "anatolia.solutions/products/agile-planner-notebook.html",
      "pay_url": "buy.stripe.com/6oE9B13ck9Pv5y09AH",
      "keywords": "offline planner, strategic planning notebook, entrepreneur planner, business model canvas notebook, SWOT analysis planner, distraction free planning, weekly productivity planner, startup planning tools, goal tracking notebook, secure planning notebook",
      "images": [
        "agile-planner-notebook.png",
        "weekly-plan.png",
        "swot-analysis.png",
        "business-model-canvas.png"
      ],
      "html_desc": "Offline strategic planning notebook combining weekly task management with SWOT analysis and Business Model Canvas tools for entrepreneurs and professionals who need distraction free, secure planning.",
      "short_desc": "The Agile Weekly Planner Notebook is designed for professionals and entrepreneurs who need focused, strategic planning without digital distractions. It combines daily task management with powerful strategic tools including SWOT Analysis and Business Model Canvas, helping you balance immediate actions with long term business planning. The offline pen and paper format keeps your sensitive strategies secure while ensuring complete focus, free from notifications and digital threats that can compromise both your productivity and confidential business insights.",
      "detail_desc": [
        {
          "title": "Weekly Plan Layout",
          "content_html": "<ul><li><em>Comprehensive Daily Planning:</em> Structure each day with dedicated task lines featuring point value (P) and duration (D) tracking, plus integrated mood monitoring for complete daily awareness and time management.</li><li><em>Weekly Progress Assessment:</em> Begin each week by evaluating previous accomplishments, creating a continuous improvement cycle that builds momentum over time.</li><li><em>Holistic Life Planning:</em> Balance professional goals with personal development sections and quality time planning for friends and family, ensuring work life integration rather than separation.</li><li><em>Strategic Problem Solving:</em> Dedicated space for identifying challenges and recognizing potential benefits, turning obstacles into opportunities for growth.</li></ul>"
        },
        {
          "title": "Planner's Strategic Thinking Tools",
          "content_html": "<ul><li><em>SWOT Analysis Framework:</em> Unlock your strategic potential with thoughtfully designed pages for analyzing strengths, weaknesses, opportunities, and threats.</li><li><em>Business Model Canvas:</em> Perfect for entrepreneurs who need clear visualization of essential business components including value propositions, customer segments, and revenue streams.</li></ul>"
        }
      ],
      "why_buy": "Whether you're managing teams, scaling a startup, or pursuing ambitious personal goals, this notebook goes beyond traditional planning to become your dedicated productivity partner. It maintains your focus on both immediate tasks and long term strategies while ensuring you nurture personal relationships and self development. More than just a planning tool, it serves as a tangible memory for your project ideas and strategic insights that you can revisit and build upon. Keep your strategic plans secure and away from malicious eyes with this offline, physical format that protects your sensitive business insights from digital threats and data breaches. Take complete control of your time, ideas, and life balance with the Agile Weekly Planner Notebook."
    },
    {
      "category": "Study Guides",
      "category_url": "study-guides",
      "name": "Talking to AI Study Guide in Turkish",
      "price": "$10.00",
      "url_name": "book-yapay-zeka-ile-konusmak",
      "full_url": "anatolia.solutions/products/book-yapay-zeka-ile-konusmak.html",
      "pay_url": "buy.stripe.com/cN2cNdcMU5zf1hKcMQ",
      "keywords": "ai prompt engineering, prompt engineering guide, AI communication guide, prompt engineering techniques, continuously updated AI guide, AI study guide, prompt templates, prompt engineering examples, AI prompting book, living AI resource",
      "images": [
        "book-yapay-zeka-ile-konusmak.png"
      ],
      "html_desc": "Comprehensive, continuously updated AI prompt engineering study guide covering 15+ advanced techniques with practical templates, examples, and hands on exercises for mastering AI communication.",
      "short_desc": "The Talking to AI Study Guide is a comprehensive, continuously updated resource for mastering AI communication and prompt engineering. Covering 15+ advanced techniques with clear explanations, ready to use prompt templates, practical examples, and hands on exercises, it helps you develop strong prompting skills for both analytical and creative work. Designed for both beginners and experienced users, this living guide evolves with AI technology, ensuring you always have the latest techniques and best practices at your fingertips.",
      "detail_desc": [
        {
          "title": "About the Book",
          "content_html": "<p>The Talking to AI Study Guide is a continuously updated resource for mastering AI communication. It covers core AI concepts, large language models, ethical considerations, and creative applications including music and image generation.</p><p>The guide focuses on prompt engineering, teaching 15+ techniques including:</p><ul><li>Zero-Shot and Few-Shot Prompting</li><li>Interactive Prompt Chaining</li><li>Chain of Thought and Tree of Thoughts Prompting</li><li>Self-Consistency Prompting</li><li>Instruction Based Prompting</li><li>Direct Stimulus Prompting</li><li>Analogical Reasoning / Association Prompting</li><li>Meta Prompting</li><li>Template Based Prompting</li><li>Contrastive / Comparison / Contrast Prompting</li><li>Exploratory Prompting</li><li>Prompt Reframing</li><li>Conditional Prompting</li><li>Latent Space Activation</li><li>Role Playing / Scenario Based Prompting</li></ul><p>Each technique includes practical examples and exercises for both beginners and experienced users. As AI technology advances, the guide expands with new techniques and insights. New sections are provided to buyers upon request, making it a living reference that grows with the field.</p>"
        }
      ],
      "why_buy": "This continuously updated guide helps you master AI communication through 15+ proven techniques, ready to use templates, and practical exercises. As AI technology evolves, the guide expands with new insights and examples, ensuring you always have current strategies for applying AI effectively in analytical and creative work.",
      "info": "This study guide has currently been prepared only in Turkish. If you would like it to be available in other languages, feel free to make a request, and we will consider it."
    },
    {
      "category": "Study Guides",
      "category_url": "study-guides",
      "name": "Software English Vocabulary Study Guide in Turkish and Practice Notebook",
      "price": "$25.00",
      "url_name": "book-programlama-ingilizcesi",
      "full_url": "anatolia.solutions/products/book-programlama-ingilizcesi.html",
      "pay_url": "buy.stripe.com/bIYbJ97sA5zfgcEbIN",
      "keywords": "technical English vocabulary, software English guide, developer English, programmer terminology, Stack Overflow examples, English for software developers, technical English learning, software vocabulary Turkish, practice notebook, English software terms, coding vocabulary",
      "images": [
        "book-programlama-ingilizcesi.png"
      ],
      "html_desc": "Master 2,222 essential software development terms with Turkish translations and authentic Stack Overflow examples. Includes dedicated practice notebook for reinforced learning and retention.",
      "short_desc": "The Software English Vocabulary Study Guide with Practice Notebook helps software professionals master 2,222 essential technical English terms. Each word includes Turkish translations and real examples from Stack Overflow discussions, showing how developers actually use these terms in practice. The companion practice notebook provides structured exercises to reinforce learning and build long term retention. Designed for beginners and intermediate learners, this comprehensive resource bridges the gap between classroom English and real world software communication, helping you collaborate confidently with international teams.",
      "detail_desc": [
        {
          "title": "About the Book",
          "content_html": "<p>The Software English Vocabulary Study Guide in Turkish contains 2,222 technical terms with Turkish translations and example sentences from real software contexts. The companion practice notebook provides structured exercises for reinforcement and review.</p><p>Examples are drawn from Stack Overflow, capturing vocabulary commonly used in technical discussions but often overlooked by traditional language resources. This makes it easier for learners to understand and confidently use English in professional software environments.</p>"
        }
      ],
      "why_buy": "Learn 2,222 technical English terms through authentic Stack Overflow examples showing real world usage. With Turkish translations and a structured practice notebook, this resource helps you communicate confidently with international teams and participate effectively in global software projects.",
      "info": "This study guide has currently been prepared only in Turkish. If you would like it to be available in other languages, feel free to make a request, and we will consider it."
    },
    {
      "category": "Study Guides",
      "category_url": "study-guides",
      "name": "Notorious Programming Related Faults in History Study Guide in Turkish",
      "price": "$10.00",
      "url_name": "book-tarihe-gecen-programatik-felaketler",
      "full_url": "anatolia.solutions/products/book-tarihe-gecen-programatik-felaketler.html",
      "pay_url": "buy.stripe.com/aFa4gA3NE4SDdAj452cQU0b",
      "keywords": "software failure case studies, famous programming bugs, security breach history, software reliability lessons, programming mistakes, post mortem analysis, tech disaster stories, software engineering failures, configuration errors, critical software bugs",
      "images": [
        "book-tarihe-gecen-programatik-felaketler.png"
      ],
      "html_desc": "Learn from real world software disasters and security breaches through detailed case studies of famous programming failures. Strengthen your critical thinking with post incident analysis and practical lessons for building reliable systems.",
      "short_desc": "The Notorious Programming Related Faults in History Study Guide examines real world software disasters through detailed case studies of famous failures and security breaches. From configuration errors and unsafe updates to weak authentication and overlooked vulnerabilities, each incident reveals how small mistakes escalated into major outages, data leaks, and financial losses. With clear explanations, post incident analysis, and practical lessons learned, this guide helps both technical and non technical readers develop a security conscious mindset and understand software reliability. By studying what went wrong and how recovery was managed, you'll sharpen your critical thinking and learn to recognize risks before they become costly mistakes.",
      "detail_desc": [
        {
          "title": "About the Book",
          "content_html": "<p>This guide examines real world software failures and security breaches that led to large scale incidents. From configuration errors and unsafe updates to weak authentication and overlooked vulnerabilities, each case study shows how small oversights escalate into outages, data leaks, and financial losses affecting millions.</p><p>Case studies include:</p><ul><li>How to Lose $440 Million in Half an Hour?</li><li>Bangladesh Central Bank Heist</li><li>The Dark Day of Cryptocurrency: 850,000 Bitcoin Theft</li><li>Boeing 737 MAX Tragedy Through Engineering Negligence</li><li>Why the World Went Without Social Media on October 4, 2021?</li><li>Minitel: The Forgotten Pioneer of Digital Diversity</li><li>The Devastating Economic Impact of the Crowdstrike Software Update</li><li>Therac-25 Radiation Machine: Healing Turned Deadly</li><li>The WannaCry Virus That Held Computers Hostage</li><li>Stuxnet Spy Virus That Crippled a Nuclear Facility</li><li>Spectre & Meltdown: The Forgotten Open Backdoors in CPUs</li><li>OpenSSL Predictable Encryption Key Vulnerability (CVE-2008-0166)</li><li>Volkswagen Emissions Scandal (Dieselgate)</li><li>E-Estonia's 3-Week Shutdown (Web War One)</li></ul><p>Each case includes post incident analysis explaining what went wrong and how recovery was managed. Designed for both technical and non technical readers, the guide helps you recognize risks early, develop security conscious thinking, and contribute to more resilient practices.</p>"
        }
      ],
      "why_buy": "Learn from real world software disasters by studying root causes and prevention strategies. Through detailed case studies, develop critical thinking skills and security awareness that help you recognize risks early and avoid costly mistakes in your projects.",
      "info": "This study guide has currently been prepared only in Turkish. If you would like it to be available in other languages, feel free to make a request, and we will consider it."
    },
    {
      "category": "Software Solutions",
      "category_url": "software-solutions",
      "name": "Lightweight Website System",
      "price": "$200.00",
      "url_name": "lightweight-website-system",
      "full_url": "anatolia.solutions/products/lightweight-website-system.html",
      "pay_url": "buy.stripe.com/3cIfZigAqbh153NfNKcQU0d",
      "keywords": "static website generator, database free website, cloudflare hosting, github pages, secure website solution, sql injection proof, json based website, low maintenance website, serverless website, ddos protected website, version controlled content, framework free website",
      "images": [
        "lightweight-website-system.png"
      ],
      "html_desc": "Database free static website system using GitHub Pages and Cloudflare for secure, high performance sites with SSL, DDoS protection, and zero server maintenance.",
      "short_desc": "Build secure, high performance websites without databases or server management. GitHub Pages provides SSL configuration while Cloudflare DNS adds DDoS mitigation and secure DNS features. Update content through JSON files with automatic version control, and generate optimized HTML via bash scripts.",
      "detail_desc": [
        {
          "title": "Inherently Secure Architecture",
          "content_html": "<p>Static HTML architecture eliminates entire categories of vulnerabilities. SQL injection becomes physically impossible without a database. No server configuration means no firewall rules to manage, no security patches to install, and no exposed ports to protect. Cloudflare Rules let you build custom security policies like geographic blocking, browser integrity checks, and bot detection patterns tailored to your needs. DNSSEC validation ensures DNS responses haven't been tampered with during transit.</p>"
        },
        {
          "title": "Professional Workflow Integration",
          "content_html": "<p>The system enforces software engineering best practices naturally. Branch protection rules prevent direct commits to production. Pull request workflows enable peer review before content goes live. This transforms content management into a disciplined process rather than ad hoc changes that bypass oversight.</p>"
        },
        {
          "title": "Complete Setup and Training Included",
          "content_html": "<p>We handle the entire technical setup for you. This includes configuring your domain with Cloudflare nameservers, connecting your GitHub repository to Pages, enabling SSL certificates, and establishing Cloudflare Rules for your security requirements. Your system arrives ready to use with your chosen template installed and configured. If you haven't worked with HTML or JSON editing before, we provide hands on training to make you comfortable managing your content. You'll learn exactly what to edit, how to commit changes safely, and how to use version control to prevent mistakes. No prior technical experience required.</p>"
        }
      ],
      "why_buy": "Traditional websites demand constant security patches, database maintenance, and server management. Plugins need updates, frameworks create compatibility nightmares, and databases expose injection vulnerabilities. This system eliminates those problems. We configure everything for you including SSL, Cloudflare protection, and your template. If you're new to JSON or HTML, training is included. Deploy once with our setup assistance, then manage content confidently with zero ongoing maintenance."
    },
    {
      "category": "Software Solutions",
      "category_url": "software-solutions",
      "name": "Lightweight Shopping Cart System",
      "price": "$300.00",
      "url_name": "lightweight-shopping-cart-system",
      "full_url": "anatolia.solutions/products/lightweight-shopping-cart-system.html",
      "pay_url": "buy.stripe.com/aFa6oIbg6bh153N6dacQU0e",
      "keywords": "database free shopping cart, secure e-commerce, whatsapp shopping cart, instant messaging orders, gdpr compliant shopping, no customer data storage, location based delivery, privacy focused e-commerce, static shopping cart, lightweight online store",
      "images": [
        "lightweight-shopping-cart-system.png"
      ],
      "html_desc": "Database free shopping cart system where customers send orders via WhatsApp or instant messaging. No personal data storage means automatic GDPR compliance and zero data breach risk.",
      "short_desc": "Accept orders securely without storing customer data. Customers create their shopping cart and send orders directly through WhatsApp or similar instant messaging apps. Since you never store personal information in a database, GDPR compliance becomes automatic and data breach liability disappears. Customers can share their location for nearby deliveries instead of typing addresses, making the checkout process faster and more convenient.",
      "detail_desc": [
        {
          "title": "Zero Data Storage, Zero Liability",
          "content_html": "<p>Traditional e-commerce platforms store customer names, addresses, phone numbers, purchase histories, and payment information in databases, creating massive legal liability under GDPR, CCPA, and similar privacy regulations. Every piece of stored data requires disclosure notices, consent mechanisms, deletion procedures, and breach notification protocols. This system eliminates that burden entirely. Customer information travels directly from their device to your instant messaging app without touching your infrastructure. You never possess personal data to secure, so you cannot leak it. Data protection responsibility belongs to WhatsApp, Telegram, or whatever messaging platform customers choose. Your legal exposure vanishes because you simply never hold the data that regulations protect.</p>"
        },
        {
          "title": "Instant Messaging Order Flow",
          "content_html": "<p>Customers browse your product catalog, add items to their cart, and review their order exactly like any modern shopping experience. When ready to complete the purchase, they tap a button that formats their cart contents and opens their preferred messaging app with you as the recipient. The formatted message includes product names, quantities, prices, and total amount. For nearby deliveries, customers can share their location directly through the messaging app instead of manually typing street addresses. This eliminates address entry errors and makes the process seamless for local customers. You receive the order as a regular message, confirm availability and delivery time, and arrange payment through your existing business processes. The entire transaction happens through familiar, encrypted messaging that both you and your customers already trust and use daily.</p>"
        },
        {
          "title": "Familiar Technical Foundation",
          "content_html": "<p>The shopping cart uses the same secure static architecture as the Lightweight Website System. Products and pricing live in JSON files with version control. GitHub Pages hosts the catalog with Cloudflare providing DNS security, SSL, and DDoS protection. The shopping cart functionality runs entirely in the customer's browser using JavaScript, with no server side processing or database queries. When customers finalize their order, JavaScript formats the cart contents into a message and opens their messaging app. We handle complete setup including domain configuration, SSL certificates, Cloudflare Rules, and template customization. Training covers JSON product management and cart configuration so you can update inventory and pricing confidently. No technical experience required.</p>"
        }
      ],
      "why_buy": "Traditional shopping carts create massive legal headaches by storing customer data. GDPR fines reach millions of euros, data breaches destroy reputations overnight, and database maintenance never ends. This system eliminates those problems by never storing personal information. Customers send orders through WhatsApp or messaging apps they already trust, share locations instead of typing addresses, and you avoid data protection regulations entirely. We configure everything including hosting, SSL, and security. Accept orders safely without the legal liability, security burden, or compliance costs of traditional e-commerce platforms."
    },
    {
      "category": "Software Solutions",
      "category_url": "software-solutions",
      "name": "Community Shopping Hub",
      "price": "$500.00",
      "url_name": "community-shopping-hub",
      "full_url": "anatolia.solutions/products/community-shopping-hub.html",
      "pay_url": "buy.stripe.com/placeholder",
      "keywords": "neighborhood shopping platform, multi vendor marketplace, local shopping aggregator, community marketplace, product category filters, vendor grouping, local delivery platform, neighborhood commerce, multi cart system, privacy focused marketplace",
      "images": [
        "community-shopping-hub.png"
      ],
      "html_desc": "Aggregated shopping platform combining multiple Lightweight Shopping Cart Systems from neighborhood vendors. Browse and order from local businesses with filtering by product type, category, and vendor.",
      "short_desc": "Community Shopping Hub brings together multiple local vendors using Lightweight Shopping Cart Systems into a unified neighborhood shopping experience. Customers can browse products from different local businesses, filter by product type or category, group by vendor or ingredients, and place orders through their preferred messaging apps. Each vendor maintains their own independent cart system while appearing together in the community hub, making it easy for residents to discover and order from all local businesses in one place without anyone storing their personal data.",
      "detail_desc": [
        {
          "title": "Unified Neighborhood Shopping Experience",
          "content_html": "<p>The Community Shopping Hub aggregates products from multiple local vendors, each running their own Lightweight Shopping Cart System. Instead of visiting separate websites for the bakery, grocery store, and restaurant in your neighborhood, customers see all available products in one organized interface. Smart filtering lets customers browse by product type (food, household items, services), category (bakery, produce, prepared meals), ingredients (gluten free, vegan, organic), or vendor. Products remain tagged with their source vendor, and orders route to the appropriate business through the same secure messaging flow individual cart systems use.</p>"
        },
        {
          "title": "Privacy Preserved Across All Vendors",
          "content_html": "<p>The hub inherits the privacy advantages of individual Lightweight Shopping Cart Systems. No central database stores customer information. When customers place orders, their data flows directly to each vendor through messaging apps without touching any shared infrastructure. Each vendor receives only orders placed with them, maintaining business privacy while customers enjoy the convenience of unified browsing. The aggregation happens purely in the customer's browser through JavaScript that fetches product data from each vendor's static JSON files. No server processes customer actions, no database logs shopping behavior, and no central authority sees transaction details.</p>"
        },
        {
          "title": "Simple Vendor Integration",
          "content_html": "<p>Joining the hub requires minimal changes to existing Lightweight Shopping Cart Systems. Vendors add standardized metadata fields to their product JSON (category tags, ingredient lists, product types) and register their cart system's data source with the hub configuration. The hub automatically pulls and displays their products alongside other vendors. Each business maintains complete control over their own product catalog, pricing, and order fulfillment while benefiting from increased visibility to neighborhood customers. Vendors can join or leave the hub without disrupting other participants, and each retains their independent cart system that continues functioning normally outside the hub.</p>"
        },
        {
          "title": "Open Source and Transparent",
          "content_html": "<p>The Community Shopping Hub code is fully open source and available on GitHub under the <a href=\"https://github.com/orgs/dbless-commerce\" target=\"_blank\">dbless-commerce organization</a>. You can review the complete implementation, understand exactly how your system works, and even contribute improvements back to the community. This transparency ensures there are no hidden behaviors, data collection, or security vulnerabilities lurking in closed source code. Technical teams can audit the codebase before deployment, customize functionality for specific needs, and maintain their own forks if desired. Open source also means the solution isn't dependent on a single vendor's continued support, the community can maintain and improve it collectively over time.</p>"
        },
        {
          "title": "Complete Setup and Vendor Onboarding",
          "content_html": "<p>We configure the Community Shopping Hub with your chosen neighborhood vendors, set up hosting through GitHub Pages with Cloudflare protection, and provide training for both hub administrators and participating vendors. Vendors learn how to format their product data for hub compatibility while maintaining their independent systems. Administrators learn how to add new vendors, configure filtering options, and manage the hub interface. Like our other systems, setup includes SSL configuration, security rules, and template customization. No technical experience required.</p>"
        }
      ],
      "why_buy": "Neighborhood businesses lose customers to large platforms because shoppers prefer browsing everything in one place. Traditional multi vendor marketplaces charge high commissions, store customer data creating GDPR liability, and lock vendors into proprietary systems. Community Shopping Hub solves these problems by aggregating local vendors without data storage, commission fees, or vendor lock in. Each business keeps their independent Lightweight Shopping Cart System and privacy advantages while gaining visibility through shared neighborhood discovery. Customers enjoy unified browsing with filtering and grouping while ordering directly through messaging apps. We handle complete setup including vendor integration and training. Build local commerce without surrendering privacy, paying platform fees, or creating shared data liability."
    }
  ]
}
