{
  "products": [
    {
      "category": "Productivity Tools",
      "category_url": "productivity-tools",
      "name": "Agile Planner Notebook",
      "price": "$10.00",
      "url_name": "agile-planner-notebook",
      "full_url": "anatolia.solutions/products/agile-planner-notebook.html",
      "pay_url": "buy.stripe.com/6oE9B13ck9Pv5y09AH",
      "keywords": "offline planner, strategic planning notebook, entrepreneur planner, business model canvas notebook, SWOT analysis planner, distraction free planning, weekly productivity planner, startup planning tools, goal tracking notebook, secure planning notebook",
      "images": [
        "agile-planner-notebook.png",
        "weekly-plan.png",
        "swot-analysis.png",
        "business-model-canvas.png"
      ],
      "html_desc": "Offline strategic planning notebook combining weekly task management with SWOT analysis and Business Model Canvas tools for entrepreneurs and professionals who need distraction free, secure planning.",
      "short_desc": "The Agile Weekly Planner Notebook is designed for professionals and entrepreneurs who need focused, strategic planning without digital distractions. It combines daily task management with powerful strategic tools including SWOT Analysis and Business Model Canvas, helping you balance immediate actions with long term business planning. The offline pen and paper format keeps your sensitive strategies secure while ensuring complete focus, free from notifications and digital threats that can compromise both your productivity and confidential business insights.",
      "detail_desc": [
        {
          "title": "Weekly Plan Layout",
          "content_html": "<ul><li><em>Comprehensive Daily Planning:</em> Structure each day with dedicated task lines featuring point value (P) and duration (D) tracking, plus integrated mood monitoring for complete daily awareness and time management.</li><li><em>Weekly Progress Assessment:</em> Begin each week by evaluating previous accomplishments, creating a continuous improvement cycle that builds momentum over time.</li><li><em>Holistic Life Planning:</em> Balance professional goals with personal development sections and quality time planning for friends and family, ensuring work life integration rather than separation.</li><li><em>Strategic Problem Solving:</em> Dedicated space for identifying challenges and recognizing potential benefits, turning obstacles into opportunities for growth.</li></ul>"
        },
        {
          "title": "Planner's Strategic Thinking Tools",
          "content_html": "<ul><li><em>SWOT Analysis Framework:</em> Unlock your strategic potential with thoughtfully designed pages for analyzing strengths, weaknesses, opportunities, and threats.</li><li><em>Business Model Canvas:</em> Perfect for entrepreneurs who need clear visualization of essential business components including value propositions, customer segments, and revenue streams.</li></ul>"
        }
      ],
      "why_buy": "Whether you're managing teams, scaling a startup, or pursuing ambitious personal goals, this notebook goes beyond traditional planning to become your dedicated productivity partner. It maintains your focus on both immediate tasks and long term strategies while ensuring you nurture personal relationships and self development. More than just a planning tool, it serves as a tangible memory for your project ideas and strategic insights that you can revisit and build upon. Keep your strategic plans secure and away from malicious eyes with this offline, physical format that protects your sensitive business insights from digital threats and data breaches. Take complete control of your time, ideas, and life balance with the Agile Weekly Planner Notebook."
    },
    {
      "category": "Study Guides",
      "category_url": "study-guides",
      "name": "Talking to AI Study Guide in Turkish",
      "price": "$10.00",
      "url_name": "book-yapay-zeka-ile-konusmak",
      "full_url": "anatolia.solutions/products/book-yapay-zeka-ile-konusmak.html",
      "pay_url": "buy.stripe.com/cN2cNdcMU5zf1hKcMQ",
      "keywords": "ai prompt engineering, prompt engineering guide, AI communication guide, prompt engineering techniques, continuously updated AI guide, AI study guide, prompt templates, prompt engineering examples, AI prompting book, living AI resource",
      "images": [
        "book-yapay-zeka-ile-konusmak.png"
      ],
      "html_desc": "Comprehensive, continuously updated AI prompt engineering study guide covering 15+ advanced techniques with practical templates, examples, and hands on exercises for mastering AI communication.",
      "short_desc": "The Talking to AI Study Guide is a comprehensive, continuously updated resource for mastering AI communication and prompt engineering. Covering 15+ advanced techniques with clear explanations, ready to use prompt templates, practical examples, and hands on exercises, it helps you develop strong prompting skills for both analytical and creative work. Designed for both beginners and experienced users, this living guide evolves with AI technology, ensuring you always have the latest techniques and best practices at your fingertips.",
      "detail_desc": [
        {
          "title": "About the Book",
          "content_html": "<p>The Talking to AI Study Guide is a continuously updated resource for mastering AI communication. It covers core AI concepts, large language models, ethical considerations, and creative applications including music and image generation.</p><p>The guide focuses on prompt engineering, teaching 15+ techniques including:</p><ul><li>Zero-Shot and Few-Shot Prompting</li><li>Interactive Prompt Chaining</li><li>Chain of Thought and Tree of Thoughts Prompting</li><li>Self-Consistency Prompting</li><li>Instruction Based Prompting</li><li>Direct Stimulus Prompting</li><li>Analogical Reasoning / Association Prompting</li><li>Meta Prompting</li><li>Template Based Prompting</li><li>Contrastive / Comparison / Contrast Prompting</li><li>Exploratory Prompting</li><li>Prompt Reframing</li><li>Conditional Prompting</li><li>Latent Space Activation</li><li>Role Playing / Scenario Based Prompting</li></ul><p>Each technique includes practical examples and exercises for both beginners and experienced users. As AI technology advances, the guide expands with new techniques and insights. New sections are provided to buyers upon request, making it a living reference that grows with the field.</p>"
        }
      ],
      "why_buy": "This continuously updated guide helps you master AI communication through 15+ proven techniques, ready to use templates, and practical exercises. As AI technology evolves, the guide expands with new insights and examples, ensuring you always have current strategies for applying AI effectively in analytical and creative work.",
      "info": "This study guide has currently been prepared only in Turkish. If you would like it to be available in other languages, feel free to make a request, and we will consider it."
    },
    {
      "category": "Study Guides",
      "category_url": "study-guides",
      "name": "Software English Vocabulary Study Guide in Turkish and Practice Notebook",
      "price": "$25.00",
      "url_name": "book-programlama-ingilizcesi",
      "full_url": "anatolia.solutions/products/book-programlama-ingilizcesi.html",
      "pay_url": "buy.stripe.com/bIYbJ97sA5zfgcEbIN",
      "keywords": "technical English vocabulary, software English guide, developer English, programmer terminology, Stack Overflow examples, English for software developers, technical English learning, software vocabulary Turkish, practice notebook, English software terms, coding vocabulary",
      "images": [
        "book-programlama-ingilizcesi.png"
      ],
      "html_desc": "Master 2,222 essential software development terms with Turkish translations and authentic Stack Overflow examples. Includes dedicated practice notebook for reinforced learning and retention.",
      "short_desc": "The Software English Vocabulary Study Guide with Practice Notebook helps software professionals master 2,222 essential technical English terms. Each word includes Turkish translations and real examples from Stack Overflow discussions, showing how developers actually use these terms in practice. The companion practice notebook provides structured exercises to reinforce learning and build long term retention. Designed for beginners and intermediate learners, this comprehensive resource bridges the gap between classroom English and real world software communication, helping you collaborate confidently with international teams.",
      "detail_desc": [
        {
          "title": "About the Book",
          "content_html": "<p>The Software English Vocabulary Study Guide in Turkish contains 2,222 technical terms with Turkish translations and example sentences from real software contexts. The companion practice notebook provides structured exercises for reinforcement and review.</p><p>Examples are drawn from Stack Overflow, capturing vocabulary commonly used in technical discussions but often overlooked by traditional language resources. This makes it easier for learners to understand and confidently use English in professional software environments.</p>"
        }
      ],
      "why_buy": "Learn 2,222 technical English terms through authentic Stack Overflow examples showing real world usage. With Turkish translations and a structured practice notebook, this resource helps you communicate confidently with international teams and participate effectively in global software projects.",
      "info": "This study guide has currently been prepared only in Turkish. If you would like it to be available in other languages, feel free to make a request, and we will consider it."
    },
    {
      "category": "Study Guides",
      "category_url": "study-guides",
      "name": "Notorious Programming Related Faults in History Study Guide in Turkish",
      "price": "$10.00",
      "url_name": "book-tarihe-gecen-programatik-hatalar",
      "full_url": "anatolia.solutions/products/book-tarihe-gecen-programatik-hatalar.html",
      "pay_url": "buy.stripe.com/aFa4gA3NE4SDdAj452cQU0b",
      "keywords": "software failure case studies, famous programming bugs, security breach history, software reliability lessons, programming mistakes, post mortem analysis, tech disaster stories, software engineering failures, configuration errors, critical software bugs",
      "images": [
        "book-tarihe-gecen-programatik-hatalar.png"
      ],
      "html_desc": "Learn from real world software disasters and security breaches through detailed case studies of famous programming failures. Strengthen your critical thinking with post incident analysis and practical lessons for building reliable systems.",
      "short_desc": "The Notorious Programming Related Faults in History Study Guide examines real world software disasters through detailed case studies of famous failures and security breaches. From configuration errors and unsafe updates to weak authentication and overlooked vulnerabilities, each incident reveals how small mistakes escalated into major outages, data leaks, and financial losses. With clear explanations, post incident analysis, and practical lessons learned, this guide helps both technical and non technical readers develop a security conscious mindset and understand software reliability. By studying what went wrong and how recovery was managed, you'll sharpen your critical thinking and learn to recognize risks before they become costly mistakes.",
      "detail_desc": [
        {
          "title": "About the Book",
          "content_html": "<p>This guide examines real world software failures and security breaches that led to large scale incidents. From configuration errors and unsafe updates to weak authentication and overlooked vulnerabilities, each case study shows how small oversights escalate into outages, data leaks, and financial losses affecting millions.</p><p>Case studies include:</p><ul><li>How to Lose $440 Million in Half an Hour?</li><li>Bangladesh Central Bank Heist</li><li>The Dark Day of Cryptocurrency: 850,000 Bitcoin Theft</li><li>Boeing 737 MAX Tragedy Through Engineering Negligence</li><li>Why the World Went Without Social Media on October 4, 2021?</li><li>Minitel: The Forgotten Pioneer of Digital Diversity</li><li>The Devastating Economic Impact of the Crowdstrike Software Update</li><li>Therac-25 Radiation Machine: Healing Turned Deadly</li><li>The WannaCry Virus That Held Computers Hostage</li><li>Stuxnet Spy Virus That Crippled a Nuclear Facility</li><li>Spectre & Meltdown: The Forgotten Open Backdoors in CPUs</li><li>OpenSSL Predictable Encryption Key Vulnerability (CVE-2008-0166)</li><li>Volkswagen Emissions Scandal (Dieselgate)</li><li>E-Estonia's 3-Week Shutdown (Web War One)</li></ul><p>Each case includes post incident analysis explaining what went wrong and how recovery was managed. Designed for both technical and non technical readers, the guide helps you recognize risks early, develop security conscious thinking, and contribute to more resilient practices.</p>"
        }
      ],
      "why_buy": "Learn from real world software disasters by studying root causes and prevention strategies. Through detailed case studies, develop critical thinking skills and security awareness that help you recognize risks early and avoid costly mistakes in your projects.",
      "info": "This study guide has currently been prepared only in Turkish. If you would like it to be available in other languages, feel free to make a request, and we will consider it."
    }
  ]
}
